<template>
	<div class="mask" v-show="agreFlag">
        <div class="agreementCon">
            <img class="chahao" @click="iAgree()" src="data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADAAAAAwCAYAAABXAvmHAAABkklEQVRoQ+2Y4U3EMAyFLxPABjACI3AbwC7tFO0usAE3AiPABjBBcU6XU1Q1vTjvmaqST6r6o6r9Pr/EcS8cdv4LO9d/cICtHXQH3AGwAr6EwALCr7sDcAnBAGoH+r5/kpxvcr0Ow/AJ5j+/jsRUAcRE0zR9hBDu5f4j9yMKgcZUAXRd9yWiH1LVUYhcfBbzexzHx1pnVQAXq08S/A6FWBIvMX/leta4qgLI1isEwRIf9agBUAim+GaAVgi2eAhAC2EhHgaohbASTwG4BRGfp7Mja43qblNqq02beClYqcWeqyQHn4V4mgNJ3BLEDJZW+RSX5kAFBF083YG0HxbWfNwHlNlpvnypDhS6zTWnBQQNYKVVRgB4djLtQmt9/pL4ZAUBO1BzSDGnWOoeqBG/1p0Ye6LZAY14S4gmgBbxVhBqAES8BYQKgCGeDaECmH/UixhoPCh0p3/7qIfEF5xQx1Q5kM067zIiv2j+PSidpGhMNcCakC2eOcAWVc9zugPuAFgBX0JgAeHX3QG4hGCA3TvwB7WVj0BaylM6AAAAAElFTkSuQmCC">   
             <!-- <p>《“为你付”用户服务协议》</p>  -->
            <div class="alertAgreement">
                <p style="text-align: center;">《“为你付”用户服务协议》</p>
 &nbsp;&nbsp;“为你付”公众号服务平台系由上海近通广告有限公司（以下简称“公司”）推出并运营的通过广告替代支付等形式向用户提供优惠折扣服务兑换券或相应权益的公众号服务平台（以下简称“本平台”）。为更好地向用户提供和推出本平台服务，各方就以下事项达成一致并自愿遵守如下协议内容。<br />第一条 定义<br />1.1本平台: 系公司通过自有渠道（如微信公众号、APP、客户端等）为用户提供前述服务的平台。用户可通过本平台查看广告、商户信息、我的兑换券、活动规则及使用指南等信息，并在本平台获得最终的优惠权益（包括但不限于本平台所赠的充值现金优惠，服务兑换券或实物商品等）。<br />1.2广告主：系在本平台投放广告，并用广告费用按照本平台约定的规则和方式支付用户获得前述权益的相关费用的客户。<br />1.3广告：系用户用于获取前述权益需根据本平台活动规则完成的广告活动，包括但不限于观看广告或参与广告任务等。<br />1.4用户：系同意本协议内容并使用本平台服务的客户。<br />1.5服务内容：系公司推出的全新个人消费模式。用户可通过购买、广告替代支付的方式获得相关商户的优惠折扣服务兑换券或相应权益，并通过参与相应活动或完成其他本平台的要求激活后，于选定商户消费时直接享受优惠折扣。<br />1.6服务兑换券：本平台提供的由商家生成的可直接用于向“卡券使用说明”中约定的适用门店进行服务兑换的条形码、二维码或数字码等其他兑换形式。<br />第二条 注册及开通服务<br />2.1用户享受本平台提供的优惠折扣服务兑换券或相应权益的，可通过点击自行充值或参与完成相应活动后通过广告替代支付的充值及根据本平台充值规则和方式注册成为享有前述权益的本平台会员用户。<br />2.2用户根据本平台提供的充值规则和方式注册，须提供已实名验证的个人手机号，填写手机号收到的由本平台发送至用户该手机号短信中的专有且唯一的验证码，设置交易密码进行注册。<br />2.3绑定手机号码：用户在申请获得本平台会员资质时设定的，包括但不限于接收由本平台发送的各种动态、交易提醒短信等信息，必要时本平台客服人员可通过此手机号码向用户核实身份信息和交易信息。每位本平台用户，仅可使用一个绑定手机号码。<br />2.4绑定个人充值账户：用户须为其在本平台充值账户绑定个人微信账户，该账户应是用户本人使用已实名验证的手机号注册开立并真实有效的个人微信账户。<br />2.5找回或修改密码：用户需在本平台申请重置或修改支付密码的，点击卡面除充值按钮以外的任一处即可进入“我的为你付”按提示流程进行操作。用户申请找回密码的，点击找回密码进入“找回密码”界面按流程操作即可在线找回支付密码；用户申请修改密码的，点击修改密码进入“修改支付密码”界面按照流程操作即可在线修改支付密码。<br />2.6用户须知，用户自主使用个人微信账户（包括账户头像、账户名称等）通过为你付公众号参与本平台相应活动及享受相应服务。用户在已经同意的微信服务协议项下的内容之外，亦同意本平台可应环境安全等级及所办理业务的情况，针对不同用户采取不同的信息采集及身份验证步骤。<br />第三条 充值、激活与消费<br />3.1用户通过本平台的充值界面，可对其在本平台的账户进行不同金额的资金充值或选定仅通过参与相应活动或完成其他广告要求获取前述权益。<br />3.2用户在充值页面使用广告主充值服务的，需参与或完成前述3.1中提到“相应活动或完成其他广告要求”以获取兑换券或相应权益。用户需根据该活动的具体要求确认获取兑换券或相应权益的活动在本平台或第三方平台完成，用户需同时遵守本平台的方式及活动规则和第三方平台的活动规则以完成相应的活动。<br />3.3用户为获得前述权益通过本平台进行充值金额及消费后剩余金额的，有且仅能通过本平台进行消费以获取前述权益，账户余额不得转出、转账、提现或通过其他任何的方式进行套现或变相套现。<br />3.4用户通过本平台在选定商户进行兑换券购买时，用户同意并接受本平台从用户的充值账户中扣除相应需支付的金额以完成该等购买。<br />3.5用户对已获得的兑换券在完成本平台要求的激活流程后可至卡券“使用说明”中约定的适用门店出示“卡包”中显示的二维码、条形码、数字码等兑换码完成服务兑换。<br />3.6用户通过本平台充值、激活与消费的，需遵守本平台的业务规则，如兑换次数、兑换周期等，具体规则以本平台约定内容为准。<br />3.7用户通过本平台购买兑换券的,应当知悉该兑换券“使用说明”中有关兑换规则、兑换有效期等使用信息。用户一经确认购买该兑换券的，视为用户同意并接受该兑换券的兑换规则并在有效期内使用该兑换券。用户有未按照兑换规则或超过有效期仍未使用该兑换券等其他用户自身原因的，用户须自行承担该兑换券成已作废状态的风险。<br />第四条 用户注意事项<br />4.1用户应当具有完全民事行为能力，限制民事行为能力、无民事行为能力人不得成为本平台的用户。如果不符合上述条件，用户应当立即停止使用本平台服务。<br />4.2用户为获取本平台会员资质时所设定的绑定账户、绑定手机号等，必须是用户本人合法获得且真实有效的，并处于用户有效掌控下的信息。因用户遗失绑定账户、变更绑定手机号码，或将绑定账户、绑定手机号码等转借、转租他人使用，或因用户原因造成的资料及交易信息等泄露所产生的风险及损失，由用户自行承担。<br />4.3用户办理充值、购买兑换券等业务须使用交易密码或兑换码等其他专有的个人操作信息，凭上述密码在本平台进行操作均视为用户本人所为。用户应妥善保管交易密码、兑换码、绑定账户、绑定手机号码及移动设备等，如因本人原因造成上述信息或设备出现遗失、泄露或被他人盗用的情况，公司不承担任何责任，已发生的损失由用户自行承担。<br />4.4用户应按规定进行操作，用户未按规定使用本平台服务或者未按规定支付结算或服务费用的，本平台有权停用直至撤销用户在本平台的服务。<br />4.5用户应当根据法律、法规、规章等规定、本协议约定以及本平台有关交易提示在本平台开展交易的，不得违背社会公序良俗，不得损害他人的合法权益。用户不得利用本平台服务进行偷逃税款，逃欠债务、套取现金、洗钱及其他违法犯罪活动。当用户存在违法违规行为时，本平台有权限制或终止提供本协议项下的服务。<br />4.6用户知悉并理解，基于互联网平台的特殊性，网站页面现实的信息可能有一定的滞后或差错。用户在本平台办理相关业务的过程中因上述原因与商户发生的任何纠纷，应联系相关商户或本平台客服协商解决。<br />4.7用户若对本协议或本平台服务存在疑问，可通过以下方式进行咨询或投诉：<br />4.7.1客服电话： 021-61815957（工作日：10：00-18:00）；<br />4.7.2本平台提供的咨询或投诉入口：“为你付”公众号页面点击“更多”-“客服咨询”；<br />4.8现平台仅支持开具纸质发票，邮寄费用由用户自行承担。
客户需开发票的，可联系客服告知抬头名称，抬头为单位的，还需填写纳税人识别号，开户银行及账号。请提交邮寄地址，收件人，联系方式。<br />第五条 兑换券性质及退款说明<br />5.1用户使用本平台购买的兑换券，系商品性质属于不宜退货、不适用无理由退货商品，用户一经确认购买该兑换券的，视为用户已完成购买兑换券且该兑换券不可退换；<br />5.2用户通过本平台使用充值服务的，该充值账户金额累计及总计余额不得超过1000元；<br />5.3 用户就剩余金额申请退款，应进入“我的中心”点击“申请退款”进入退款界面，根据退款界面显示的退款规则申请退款，退款规则如下：<br />5.3.1 用户需退款的，应按退款界面流程据实填写申请信息及界面流程申请退款，用户已申请开具发票的，须自行返还原始发票，邮寄费用自行承担；
<br />5.3.2为你付平台仅支持对每一单笔充值订单进行退款；<br />5.3.3申请余额退款时，需保留充值该单笔充值时所享受到的平台赠送的所有优惠（优惠包括：充值返现、活动返现及充值时获得的任何形式的平台权益等）；<br />5.3.4余额退款一次性全部退还，需扣取10元人民币管理手续费；<br />5.3.5退款金额将在申请审核完成后15个工作日内返还至充值时的原支付账号。<br />第六条 系统运营与维护<br />6.1本平台负责平台的日常运营和维护，有权对平台服务进行升级、改造。本平台根据系统升级、改造的需要可以暂时中止提供本平台服务，但应提前通过平台公告等方式告知用户，并预告恢复日期。<br />6.2用户同意并许可本平台可对用户在本平台的所有操作进行记录。用户不得以任何方式干扰本平台的正常运转，不得诋毁、损害本平台声誉或攻击本平台,就用户有该行为的,本平台将保留追究法律责任的权利。<br />6.3用户同意，为保障用户账户及资金安全，本平台可对其认为可疑、异常或高风险的本平台的交易行为采取阻断或中止措施，对于阻断或中止的交易，用户同意按照本平台的要求，协助本平台核实该用户的有效身份信息及交易情况，对用户因此可能遭受的不便或损失，本平台不承担任何责任。<br />第七条 信息保密与授权<br />7.1本平台将遵守相关法律法规及相关规定，采取合理措施保障用户个人信息的安全。在本协议履行过程中，用户向本平台提供的本平台不能从公共渠道取得的用户信息，均构成用户的保密信息，除根据法律法规及相关规定必须进行披露或双方另有约定的情形外，本平台不得向任何第三方披露或许可使用该保密信息。<br />7.2用户同意并授权本平台，除法律法规另有规定之外，将用户提供给本平台的信息、享受本平台服务产生的信息（包括本授权条款签署之前提供和产生的信息）等，用于本平台及其因服务必要而开展合作或委托的合作伙伴及关联企业，为用户提供服务、推荐产品、开展市场调查与信息数据分析等。本平台承诺自行并要求合作伙伴及关联企业对上述信息严格保密，采取措施保护信息安全（用户登录本平台合作伙伴及关联企业网站或任何第三方网站时自主授权同意第三方获取用户相关信息的除外）。上述用户包括但不限于：用户为获取本平台会员资质及使用本平台服务时向本平台提供的个人信息，用户通过本平台参与广告主活动或访问网站时本平台自动接收并记录的用户数据，如IP地址、参与活动页面填写身份验证信息等；本平台通过合法、公开途径获取的其他用户个人信息等。<br />7.3若本平台发现用户在非安全、存在欺诈风险的情况下操作账户，用户许可并授权本平台增加核实用户身份的措施，以保障用户权益。增加措施包括但不限于：要求用户进行生物识别验证、输入短信密码、验证码、补充相关个人信息或提供个人身份证明信息等。若用户存在可疑交易且无法解释交易的合理性时，本平台有权对该笔交易采取限制措施。<br />7.4用户授权本平台在发生以下情形时，本平台有权对该用户充值账户及兑换券状态采取限制措施，包括但不限于止付、止收、限制激活、兑换，将账户和兑换券状态改为未激活，解除绑定账户直至强制销户，相关责任及由此产生的损失均由用户承担：<br />7.4.1本平台有证据证明该用户充值账户并非由用户本人开立的；<br />7.4.2用户否认本平台充值账户由本人开立；<br />7.4.3绑定账户非用户本人账户；<br />7.4.4用户未按规定使用本平台服务的，本平台有权停用直至撤销本平台充值账户服务；<br />7.4.5用户违反本协议或使用本平台服务的；<br />7.4.6其他本平台认为可能对账户安全性产生影响的情形。<br />7.5以下信息不属于保密信息：<br />（1）有书面证据表明接收信息一方先前已通过合法方式知悉的任何信息；<br />（2）非因接收信息方的过错而进入公共领域的信息；<br />（3）接收信息一方于接收信息后从其他途径合法获得的信息。<br />7.6尽管有本协议其他规定，本条规定的效力不受本协议终止的影响。<br />第八条 知识产权<br />8.1本平台对本平台所刊登的文字、图表、图像、标识、图标、声音文件片段、数字文件和软件等资料信息拥有知识产权。未经本平台书面许可，用户不得以任何方式对上述资料信息进行使用、复制、发行、修订、改写、汇编、发布、翻译、分发或制作派生作品等。<br />8.2本平台基于本用户服务协议提供的内容和技术的知识产权由原所有方享有。用户确认并同意，本平台向其提供软件、规范、程序使用以及相关技术支持的行为不构成向其转让或许可其享有的知识产权（包括但不限于专利、版权商标、专有技术、保密信息等其他知识产权）。<br />8.3为执行用户服务协议及本平台项下活动之目的，用户同意无偿授权许可本平台在宣传资料、名片、网站建设、APP、手机程序、微信界面以及其他任何方面使用、复制用户所有相关的个人名称、图像或其他任何对方拥有知识产权的内容进行广告宣传及商业活动，包括但不限于图形、文字、颜色等。用户承诺及保证，其授权本平台使用、复制的个人名称、图像、标志和其他知识产权内容，不会对任何第三方知识产权构成任何侵权，并确保本平台免于因此遭受其他第三方权利主张及索赔之损失和费用。<br />第九条 不可抗力<br />9.1“不可抗力”是指本协议双方不能合理控制、不可预见或即使预见亦无法避免的事件，该事件使任何一方根据本协议履行其全部或部分义务已不可能。该事件包括但不限于法律法规变化、政策变化、政府行为、地震、台风、洪水、火灾或其它天灾、战争或任何其它类似事件。鉴于互联网之特殊性质，不可抗力亦包括下列影响互联网正常运行之情形:<br />（1）黑客攻击；<br />（2）电信部门技术调整；<br />（3）因政府管制而造成之暂时关闭；<br />（4）病毒侵袭。<br />9.2因不可抗力或其他不可归因于本平台的情况（包括但不限于政府机关等政策、指令、微信平台或腾讯对微信公众号的管制行为、商户过错行为、用户通讯故障、网络拥堵、供电系统故障等）所引起的平台服务故障及由此产生的服务中断、终止、错误等而无法向用户提供服务的，本平台免于承担责任但本平台会尽可能合理地协助处理善后事宜，并努力使用户免受或减少经济损失。<br />第十条 违约责任<br />10.1用户违反本协议约定的任何义务、承诺或保证的，本平台有权根据违约情况要求用户停止违约行为，采取补救措施、继续履行义务，或者根据违约情况采取纠正违约行为、中止或终止用户资格等法律法规允许或本协议约定可采取的一切相关措施，对用户因此可能遭受的不便或损失，本平台不承担任何责任。<br />第十一条 协议变更与终止<br />11.1用户勾选本协议并获取本平台会员资质的，即表明用户已同意本协议全部内容，理解并确认本协议中有关免除、限制公司的条款，本协议即时生效。<br />11.2用户同意公司有权根据法律法规及相关规定或业务需要，不时对本协议内容及本平台公告后按公告内容执行，无需另行通知用户。如用户在公告施行后继续使用本平台服务平台的，视为用户接受上述变更双方无须另行签订书面协议。<br />第十二条 法律适用和争议解决<br />12.1本协议的成立、生效、履行、变更、解释及争议解决等适用中华人民共和国（不包括香港特别行政区、澳门特别行政区及台湾地区）法律。<br />12.2争议解决<br />12.2.1 本协议项下的一切争议，双方应首先通过友好协商的方式解决。如果在争议发生后三十日内未能协商解决，则任何一方均有权将争议提交上海国际经济贸易仲裁委员会，按申请仲裁时该会有效的仲裁规则在上海进行仲裁。<br />12.2.2 仲裁裁决是终局的，对仲裁双方均有约束力。特别的，双方认可并承诺，受限于中国法律的规定，仲裁员有权在法律允许及可行的范围内根据实际情况做出适当的裁决，对于该等裁决，双方应予以执行。<br />12.2.3 在争议解决期间，双方应继续履行本协议所规定除争议事项外的其它各项条款。<br />12.2.4仲裁裁决生效后，任何一方均有权向具有管辖权的法院申请执行仲裁裁决。<br />12.3一方不行使或延迟行使其根据本协议或法律享有的任何权利、权力和补救将不会导致对该等权利的放弃，并且，任何对单个或部分该方权利的放弃亦不排除该方对该等权利以其他方式的行使以及对其他该方权利的行使。<br />12.4本协议各条的标题仅为索引而设，在任何情况下，该等标题不得用于或影响对本协议条文的解释。<br />12.5本协议的每一条款均可分割且独立于其他每一条款，如果在任何时候本协议的任何一条或多条条款成为无效、不合法或不能执行，本协议其他条款的有效性、合法性和可执行性并不因此而受到影响。<br />12.6未经另一方事先书面同意，任何一方不得向任何第三方转让其于本协议下的任何权利及/或义务。<br />12.7本协议未尽事宜，按本平台约定的规则和方式，公告补充规定或通知，补充规定或通知与本协议具有同等法律效力。<br/>
<br/>
            <p style="text-align: center;">《“为你付”使用章程》</p>
                一.  概述<br/>
                1.  定义：“为你付”卡系由上海近通广告有限公司推出并仅用于“为你付”平台消费的预付卡，为扩大经营更好地提供和推出业务服务，现以特定的形式发行的专用于“为你付”平台的预售购买卡。为规范使用和管理，特制定本章程。<br/>
                2.  服务：购卡人/持卡根据发卡方提供的规则和方式进行购买，须提供已实名验证的个人手机号，填写手机号收到的由发卡方发送至购卡人/持卡人该手机号短信中的专有且唯一的验证码，设置交易密码进行购买。<br/>
                3.  面值：“为你付”卡的卡面面值包括但不限于100元，150元，200元，300元，500元, 1000元等。<br/>
                4.  类别：“为你付”不记名卡，单张面值不得超过人民币1000元（含1000元）；“为你付”记名卡，单张面值不得超过5000元（含5000元）。购卡人购买记名卡的，应提供身份信息及有效证明文件。<br/>
                5.  发卡方、购卡人、持卡人、售卡渠道及其他当事人均须遵守本章程。同意遵守本章程之约定内容，并满足本章程规定购券条件的单位或个人可向上海近通广告有限公司购买上海“为你付”单用途商业预付卡。<br/>
                二.  发卡方的权利义务<br/>
                1.  发卡方有权要求购卡人按前述规定在必要时提供身份信息及证明文件；<br/>
                2.  违反本章程使用“为你付”单用途商业预付卡的，发卡方有权暂停或终止该单用途商业预付卡的使用；<br/>
                3.  因以下原因导致持卡人不能正常使用“为你付”单用途商业预付卡的，发卡方对持卡人遭受的任何损失不承担任何责任，但可为持卡人提供必要的帮助：<br/>
                a)  “为你付”卡经平台公告后的系统停机维护；<br/>
                b)  电信设备故障导致数据传输失败或中断；<br/>
                c)  因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力原因，造成系统障碍不能运行业务；<br/>
                d)  电信、电力或银行的系统、设备、平台故障、不稳定或升级维护等原因而造成的服务中断、延迟或不稳定。<br/>
                4.  发卡方应当通过推送信息及平台告示的方式向持卡人提供“为你付”单用途商业预付卡使用的有关资料，包括章程、购卡协议、使用须知、收费项目及标准等。<br/>
                5.  发卡方应当按协议约定为持卡人提供服务，并在技术上保证交易活动的顺利进行。<br/>
                6.  发卡方应依法对从购卡人/持卡人处获得的机密信息承担保密义务，未经当事人同意不得向任何第三方披露，但法律、法规另有规定或购卡人/持卡人与发卡方另有约定的除外。<br/>
                三.  购卡人/持卡人的权利义务<br/>
                1.  购卡人享有按本章程的规定及发卡方与购卡人的协议约定购买、使用“为你付”单用途商业预付卡和获得相应服务的权利。<br/>
                2.  购卡人/持卡人有权知晓“为你付”单用途商业预付卡的功能、使用方法、收费项目及标准、售卡场所以及商品购买方式等。详情查询“为你付”微信官方公众号。<br/>
                3.  购卡人/持卡人对“为你付”单用途商业预付卡交易有疑问的，可以在规定时间内向“为你付”提出查询或更正要求。<br/>
                4.  如购卡人一次性购券价值1万元（含）以上的，应提供身份信息及有效证明文件，包括但不限于购卡人及其代理人姓名或单位名称、有效身份证件号码（个人身份证或单位营业执照）和联系方式。<br/>
                5.  购卡人/持卡人应当按前述规定在必要时向“为你付”提供真实有效的身份信息及证明文件，不得冒用他人身份或使用伪造、变造身份证明文件购买“为你付”单用途商业预付卡。<br/>
                6.  购卡人/持卡人为购买“为你付”卡绑定手机号的，必须是购卡人/持卡人本人合法获得且真实有效的，并处于购卡人/持卡人有效掌控下的信息。因购卡人/持卡人变更绑定手机号码，或将绑定手机号码等转借、转租他人使用，或因购卡人/持卡人原因造成的资料及交易信息等泄露所产生的风险及损失，由购卡人/持卡人自行承担。<br/>
                7.  购卡人/持卡人办理购买、进行消费等业务须使用交易密码或兑换码等其他专有的个人操作信息，凭上述密码进行操作的均视为购卡人/持卡人本人所为。购卡人/持卡人应妥善保管交易密码、兑换码、绑定账户、绑定手机号码及移动设备等，如因本人原因造成上述信息或设备出现遗失、泄露或被他人盗用的情况，发卡方不承担任何责任，已发生的损失应自行承担。<br/>
                8.  购卡人/持卡人未按本章程规定及与发卡方的用户协议约定进行交易造成经济损失的，应当自行承担。<br/>
                四.  注意事项<br/>
                1.  购卡人可以通过微信公众平台“为你付”平台购买“为你付”单用途商业预付卡，详情请关注“为你付”官方公众号。<br/>
                2.  当发卡方终止兑付未到期单用途卡的，发卡方应向购卡人/持卡人提供退卡服务，并在终止兑付日前至少30日内在备案机关指定的媒体上公示，且发卡方应以信息告知、短文推送及平台公告的形式告知购卡人/持卡人。有以下情形的，发卡方可就购卡人/持卡人的退卡要求不予受理：<br/>
                1)  当终止兑付未到期单用途卡公告发出的30日内未按照退卡规及未到指定受理处办理退卡手续的。<br/>
                2)  当发卡方已尽终止兑付单用途卡的告知义务，购卡人/持卡人选择自动放弃办理退卡的。<br/>
                3.  “为你付”单用途商业预付卡的具体期限以“为你付”平台公告的期限为准。如持卡人欲退卡，可通过平台进入退款界面申请退款，退款规则如下:<br/>
                a)  用户需退款的，应按退款界面流程据实填写申请信息及界面流程申请退款；用户已申请开具发票的，须自行返还原始发票；<br/>
                b)  为你付平台仅支持对每一单笔充值订单进行退款；<br/>
                c)  申请余额退款时，需保留充值该单笔充值时所享受到的平台赠送的所有优惠（优惠包括：充值返现、活动返现及充值时获得的任何形式的平台权益等）；<br/>
                d)  余额退款一次性全部退还，需扣取10元人民币管理手续费；<br/>
                e)  退款金额将在申请审核完成后15个工作日内返还至充值时的原支付账号。<br/>
                4.  “为你付”卡发卡方不提供上海“为你付”单用途商业预付卡的挂失、透支、提取现金、转让等其他服务<br/>
                5.  现平台仅支持开具纸质发票，邮寄费用由用户自行承担。客户需开发票的，可联系客服告知抬头名称，抬头为单位的，还需填写纳税人识别号，开户银行及账号。另请提交邮寄地址，收件人及联系方式。<br/>
                6.  持卡人存在以下情况的，发卡方有权暂停或终止对持卡人的服务，所有损失需由持卡人承担：<br/>
                a)  持卡人在购买或使用“为你付”单用途商业预付卡时存在欺诈或其他不诚实行为；<br/>
                b)  持卡人违反国家的法律法规进行非法交易的；<br/>
                c)  发卡方核实持卡人身份及“为你付”单用途商业预付卡交易信息等情况，遭持卡人拒绝的；<br/>
                d)  持卡人有其他损害发卡方、售卡平台及其他持卡人合法权益情形的。<br/>
                五.  附则<br/>
                1.  本章程由上海近通广告有限公司制订。本公司有权根据需要修改本章程，但将采取适当的形式提前公告，本章程的修改或调整公布后即生效，不再逐一通知购卡当事人。若当事人在本章程修改之后仍继续购买及使用“为你付”单用途商业预付卡的，即视为当事人接受章程的修改。<br/>
                2.  本章程未尽事宜，当事人应遵守国家法律、法规及用户协议、购卡人与为发卡方的协议约定。<br/>
                3.  任何由本章程引起的争议，双方应协商解决。<br/>
                4.  本章程自公布之日起正式实施。<br/>
            </div>
            <div class="confirmBtn" @click="iAgree()">同 意</div>    
        </div>
        
    </div>
</template>

<script type="text/javascript">
	export default {
        props:["agreFlag"],
        methods:{
            iAgree() {
                this.$emit('agreChange', false); //主动触发父组件agreChange方法，false为向父组件传递的数据
            },
        }
    }
</script>

<style>
.mask {
	width: 100%;
	height: 100%;
	position: fixed;
	top: 0;
	left: 0;
	background:rgba(0, 0, 0, 0.6);
	z-index: 10;
}
.agreementCon {
	width: 90%;
	height: 15rem;
	border-radius: 0.266667rem;
	-webkit-border-radius: 0.266667rem;
	border: 1px solid #999999;
	padding: 0.5rem 0.2rem 0;
	line-height: 0.52rem;
	color: #333;
	background-color: #fff;
	position: fixed;
	top: 50%;
	left: 50%;
	transform: translateX(-50%) translateY(-50%);
	-webkit-transform: translateX(-50%) translateY(-50%);
	z-index: 12;
	box-sizing: border-box;
}
.alertAgreement {
	width: 100%;
	height: 12.6rem;
	overflow-y: scroll;
	padding-top: 0.2rem;
	box-sizing: border-box;
	overflow-scrolling: touch;
	-webkit-overflow-scrolling: touch;
}
.agreementCon p {
	text-align: center;
	margin-top: -0.032rem;
	margin-bottom: 0.2rem;
}
.confirmBtn {
	position: absolute;
	left: 0;
	bottom: -0.026667rem;
	text-align: center;
	width: 100%;
	height: 1rem;
	line-height: 1rem;
	border-top: 1px solid #efefef;
	background-color: #fff;
	z-index: 20;
	border-bottom-right-radius: 0.266667rem;
	border-bottom-left-radius: 0.266667rem;
	color: #4092ff;
	font-size: 0.4rem;
}
.chahao {
	width: 0.533333rem;
	position: absolute;
	top: 0.466667rem;
	right: 0.333333rem;

}
</style>